quantummongolia/industrial-iot/esp32_firmware/butluur/src/main.cpp
  uint32_t energyRaw = 0;
  r.energyOk = withRetry(
      [&] { return mb.readU32LowFirst(slave, cfg::SPM33_REG_ENERGY, energyRaw); });
  if (r.energyOk) {
    // 40026 нь primary side kWh-ийг ×0.1-ээр өгдөг (5.1 хүснэгт)
    r.energyKWh = energyRaw * 0.1f;
  }

  return r;
}

// ── Глобал ─────────────────────────────────────────────────────────────
Modbus modbus;
FirebaseData fbData;
FirebaseAuth fbAuth;
FirebaseConfig fbConfig;

bool firebaseReady = false;
unsigned long lastWifiCheck = 0;
unsigned long wifiDisconnectedAt = 0; // 0 = холбоотой; !=0 = тасрахад эхэлсэн агшин
unsigned long lastTotalizerReadTime = 0; // Сүүлд totalizer уншсан агшин (ms)
unsigned long lastHeapLogTime = 0;       // Сүүлд heap-н хэмжээг log хийсэн агшин

unsigned int consecutiveReadFails = 0;
unsigned int totalRecoveryAttempts = 0;

unsigned long fbNextAllowedAt = 0;
unsigned int fbFailStreak = 0;
bool wifiOnBackup = false;            // одоо нөөц сүлжээ (Photon) дээр байна уу
unsigned long primaryRetryAt = 0;     // нөөц дээр байх үед энэ хугацаанд Mandal-ыг дахин шалгана

// Totalizer утга 1 минутад нэг л шинэчлэгдэх тул хооронд нь cache-д хадгална.
// Анхны boot-д valid биш — эхний амжилттай уншилт хүртэл Firebase-руу бичигдэхгүй.
double cachedWeightT = 0.0;        bool cachedWeightTValid = false;
float  cachedEm03EnergyKWh = 0.0f; bool cachedEm03EnergyValid = false;

void fbOnFailure() {
  fbFailStreak++;
  unsigned long backoff =
      2000UL * (1UL << min((unsigned int)8, fbFailStreak));
  if (backoff > 300000UL)
    backoff = 300000UL;
  fbNextAllowedAt = millis() + backoff;
  Serial.printf("[Firebase] Backoff %lus (fail streak %u)\n", backoff / 1000,
                fbFailStreak);
}

void fbOnSuccess() {
  if (fbFailStreak > 0)
    Serial.println("[Firebase] Recovered");
  fbFailStreak = 0;
  fbNextAllowedAt = 0;
}

bool fbCanUpload() { return (long)(millis() - fbNextAllowedAt) >= 0; }

void recoverModbusBus() {
  totalRecoveryAttempts++;
  Serial.printf("[Recovery] Attempt #%u after %u failed cycles\n",
                totalRecoveryAttempts, consecutiveReadFails);
  if (totalRecoveryAttempts >= cfg::MAX_RECOVERY_ATTEMPTS) {
    Serial.println("[Recovery] Max attempts — forcing reboot via WDT");
    delay(100);
    while (true) {
    }
  }
  modbus.recover();
  consecutiveReadFails = 0;
  Serial.println("[Recovery] RS485 bus re-initialized");
}

void onWifiEvent(WiFiEvent_t event) {
  switch (event) {
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    Serial.println("[WiFi] Disconnected — attempting auto-reconnect");
    if (wifiDisconnectedAt == 0)
      wifiDisconnectedAt = millis(); // тасралтгүй тасарсан эхний агшныг тэмдэглэнэ
    WiFi.reconnect();
    break;
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.printf("[WiFi] Reconnected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
    wifiDisconnectedAt = 0;
    break;
  default:
    break;
  }
}

// Нөөц сүлжээ (Photon) тохируулсан эсэх.
static bool wifiHasBackup() { return WIFI_SSID2[0] != '\0'; }

// Нэг сүлжээнд блоклон холбогдохыг оролдоно. Амжилттай бол true.
static bool wifiTry(const char *ssid, const char *pass, uint32_t timeoutMs) {
  Serial.printf("[WiFi] Connecting to network: %s", ssid);
  WiFi.begin(ssid, pass);
  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < timeoutMs) {
    delay(500);
    Serial.print(".");
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[WiFi] Connected to %s — IP: %s\n", ssid,
                  WiFi.localIP().toString().c_str());
    return true;
  }
  Serial.printf("\n[WiFi] %s failed\n", ssid);
  return false;
}

// Strict-priority холболт: ҮРГЭЛЖ эхэлж үндсэн (Mandal) сүлжээнд оролдоно, зөвхөн
// бүтэхгүй үед нөөц (Photon) рүү шилжинэ. Дохионы хүчээр (RSSI) сонгохгүй.
void wifiConnect() {
  if (WiFi.status() == WL_CONNECTED)
    return;

  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);

  if (wifiTry(WIFI_SSID, WIFI_PASSWORD, 10000)) {
    wifiOnBackup = false;
    return;
  }
  if (wifiHasBackup() && wifiTry(WIFI_SSID2, WIFI_PASSWORD2, 10000)) {
    wifiOnBackup = true;
    primaryRetryAt = millis() + cfg::BACKUP_HOLD_MS;
    return;
  }
  Serial.println("[WiFi] All networks failed — will retry later");
}

// Холбоотой үед ажиллах failover шийдвэр:
//  • Mandal дээр байгаа ч Firebase рүү өгөгдөл явахгүй (fail streak) бол → Photon руу.
//  • Photon дээр байгаа бол BACKUP_HOLD_MS тутамд Mandal сэргэсэн эсэхийг шалгана.
void wifiFailover(unsigned long now) {
  if (WiFi.status() != WL_CONNECTED || !wifiHasBackup())
    return;

  if (!wifiOnBackup) {
    // Үндсэн (Mandal) дээр. Firebase тогтмол алдаж, throttle гарсан бол нөөц рүү.
    if (fbFailStreak >= cfg::FB_FAILOVER_STREAK && now >= primaryRetryAt) {
      Serial.printf("[WiFi] Primary up but Firebase failing (streak %u) — trying backup\n",
                    fbFailStreak);
      primaryRetryAt = now + cfg::BACKUP_HOLD_MS;
      if (wifiTry(WIFI_SSID2, WIFI_PASSWORD2, 10000)) {
        wifiOnBackup = true;
      } else {
        Serial.println("[WiFi] Backup unavailable — staying on primary");
        wifiTry(WIFI_SSID, WIFI_PASSWORD, 10000);
      }
      fbFailStreak = 0;
      fbNextAllowedAt = 0;
    }
    return;
  }

  // Нөөц (Photon) дээр. Хааяа Mandal сэргэсэн эсэхийг шалгаж, сэргсэн бол буцна.
  if (now >= primaryRetryAt) {
    primaryRetryAt = now + cfg::BACKUP_HOLD_MS;
    Serial.println("[WiFi] Re-checking primary (Mandal)...");
    if (wifiTry(WIFI_SSID, WIFI_PASSWORD, 8000)) {
      wifiOnBackup = false;
      Serial.println("[WiFi] Back on primary (Mandal)");
    } else {
      wifiTry(WIFI_SSID2, WIFI_PASSWORD2, 10000);
    }
    fbFailStreak = 0;
    fbNextAllowedAt = 0;
  }
}

void firebaseInit() {
  fbConfig.api_key = FIREBASE_API_KEY;
  fbConfig.database_url = FIREBASE_DB_URL;
  fbAuth.user.email = FIREBASE_USER_EMAIL;
  fbAuth.user.password = FIREBASE_USER_PASS;
  fbConfig.token_status_callback = tokenStatusCallback;
  fbData.setBSSLBufferSize(2048, 2048);
  Firebase.begin(&fbConfig, &fbAuth);
  Firebase.reconnectNetwork(true);
  Serial.println("[Firebase] init — authenticating");
}

void setup() {
  Serial.begin(115200);
  delay(300);
  Serial.println("\n========= Butluur IoT (S3 N8R2) =========");

  led::begin();
  xTaskCreatePinnedToCore(ledTask, "ledTask", 2048, nullptr, 1, nullptr, 0);

  modbus.begin();

