quantummongolia/industrial-iot/esp32_firmware/butluur/src/main.cpp
  // SPM33 CT primary утгыг боотлох үед уншиж кэшилнэ — P (40011) болон гүйдлийг
  // secondary→primary хөрвүүлэхэд хэрэглэнэ. Унших нь алдвал loop() cycle бүрт
  // амжилттай болтол дахин оролдоно.
  delay(100);
  Spm33_readCtPrimary(modbus, cfg::EM03_SLAVE);

  WiFi.onEvent(onWifiEvent);
  wifiConnect();
  firebaseInit();

  esp_task_wdt_config_t wdtConfig = {.timeout_ms = cfg::WDT_TIMEOUT_S * 1000,
                                     .idle_core_mask = 0,
                                     .trigger_panic = true};
  esp_task_wdt_reconfigure(&wdtConfig);
  esp_task_wdt_add(NULL);
  Serial.printf("[WDT] Watchdog started — %lu second timeout\n",
                (unsigned long)cfg::WDT_TIMEOUT_S);
}

void loop() {
  esp_task_wdt_reset();
  unsigned long now = millis();

  // ── Long-running stability watchdog ────────────────────────────────
  // Heap fragmentation (Firebase TLS буфер г.м.) удаан ажиллах тусам
  // хуримтлагдаж тогтворгүй болгож болзошгүй. 5 минут тутамд heap-г log
  // хийнэ. Free heap босгоос (20KB) доош унавал эсвэл uptime 24 цаг хэтэрвэл
  // clean restart хийнэ.
  if (now - lastHeapLogTime >= cfg::HEAP_LOG_INTERVAL_MS) {
    lastHeapLogTime = now;
    Serial.printf("[Heap] Free: %u | Min ever: %u | Uptime: %lus\n",
                  ESP.getFreeHeap(), ESP.getMinFreeHeap(), now / 1000);
  }
  if (ESP.getFreeHeap() < cfg::MIN_FREE_HEAP_BYTES) {
    Serial.printf("[Stability] Free heap %u < %u — restarting\n",
                  ESP.getFreeHeap(), cfg::MIN_FREE_HEAP_BYTES);
    delay(200);
    ESP.restart();
  }
  if (now >= cfg::MAX_UPTIME_MS) {
    Serial.println("[Stability] Reached 24h uptime — scheduled restart");
    delay(200);
    ESP.restart();
  }

  // WiFi.reconnect() / auto-reconnect зарим тохиолдолд бодит сүлжээ сэргэсэн ч
  // chip-ийн WiFi stack хатуу "stuck" болсон үед амжилтгүй хэвээр үлддэг —
  // үүнийг зөвхөн бүрэн restart л засдаг тул threshold давсан бол reboot хийнэ.
  if (wifiDisconnectedAt != 0 &&
      now - wifiDisconnectedAt >= cfg::WIFI_DISCONNECT_RESTART_MS) {
    Serial.println("[Stability] WiFi 5+ минут тасархад — restarting");
    delay(200);
    ESP.restart();
  }

  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    Serial.println("[WiFi] retry — reconnect (primary first)");
    wifiConnect();
  }
  wifiFailover(now);

  static unsigned long lastPoll = 0;
  if (now - lastPoll < cfg::POLL_MS)
    return;
  lastPoll = now;

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[WiFi] not connected");
    led::setMode(led::SLOW_RED);
    return;
  }

  // Boot үед уншиж чадаагүй CT primary-г дахин оролдоно.
  if (!ctPrimaryKnown[cfg::EM03_SLAVE]) {
    Spm33_readCtPrimary(modbus, cfg::EM03_SLAVE);
    delay(cfg::FRAME_GAP_MS);
  }

  // Цикл бүрд flow-cycle эсвэл totalizer-cycle гэсэн 2 төрлийн нэг нь явна.
  // RS485 bus-н ачааллыг бууруулж, totalizer-ийг тусад нь 1 минутын циклд уншина.
  // Boot-ийн дараа нэг удаа totalizer-ийг шууд уншиж cache-г бөглөнө.
  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  // Энэ цикл-д Firebase upload руу очих утгууд (flow cycle-ийнх)
  float flow = 0;
  bool flowOk = false;
  Spm33Reading em03;

  // Totalizer cycle-ийн төлөв
  double weightT = 0;
  bool weightOk = false;

  if (totalizerCycle) {
    // ── Totalizer cycle: жингийн нийт жин + EM03 энерги
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

    weightOk = withRetry(
        [&] { return modbus.readDouble(cfg::SCALE_SLAVE, cfg::REG_WEIGHT_T, weightT); });
    if (weightOk) { cachedWeightT = weightT; cachedWeightTValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em03 = Spm33_readEnergy(modbus, cfg::EM03_SLAVE);
    if (em03.energyOk) { cachedEm03EnergyKWh = em03.energyKWh; cachedEm03EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    Serial.printf("[Totalizer] Weight:%s EM03:%s\n",
                  weightOk ? String(weightT, 3).c_str() : "#",
                  em03.energyOk ? String(em03.energyKWh, 1).c_str() : "#");
  } else {
    // ── Flow cycle: жингийн урсгал + EM03 power + currents
    flowOk = withRetry(
        [&] { return modbus.readFloat(cfg::SCALE_SLAVE, cfg::REG_FLOW, flow); });
    delay(cfg::FRAME_GAP_MS);

    em03 = Spm33_readPower(modbus, cfg::EM03_SLAVE, true);
    delay(cfg::FRAME_GAP_MS);

    Serial.printf("[Flow] Scale:%s EM03:%s\n",
                  flowOk ? String(flow, 2).c_str() : "#",
                  em03.powerOk ? String(em03.powerKW, 2).c_str() : "#");
  }

  // ── Алдаа escalate ──────────────────────────────────────────────
  bool anyOk = flowOk || weightOk || em03.powerOk || em03.energyOk ||
               em03.currentsOk;
  if (anyOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_FAILS)
      recoverModbusBus();
  }

  // ── Firebase upload — /butluur ба /energy_meters subtree-үүдийг тус тусад нь
  // жижиг updateNode-оор бичнэ (rules engine-д бүх замыг шалгуулахаас сэргийлнэ).
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] ready");
    ota::begin(&fbData);  // DEVICE_ID register + командын stream нээх
  }

  // ─ Subtree 1: /butluur ─────────────────────────────────────────────
  bool butluurOk = true;
  bool butluurAny = false;
  {
    FirebaseJson j;
    if (totalizerCycle) {
      // Totalizer cycle: жингийн нийт жин (тонн, t)
      if (weightOk) {
        j.set("cumulative_t", cachedWeightT);
        butluurAny = true;
      }
    } else {
      // Flow cycle: жингийн урсгал
      if (flowOk) { j.set("weight_rate", flow); butluurAny = true; }
    }
    if (butluurAny) {
      j.set("last_updated", (int)(millis() / 1000));
      butluurOk = Firebase.RTDB.updateNodeSilent(&fbData, "/butluur", &j);
      if (!butluurOk)
        Serial.printf("[Firebase] /butluur ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  // ─ Subtree 2: /energy_meters/em03 ──────────────────────────────────
  // Flow cycle: power + currents (instantaneous утгууд)
  // Totalizer cycle: total_energy_kwh (cumulative утгууд)
  bool emOk = true;
  bool emAny = false;
  {
    FirebaseJson j;
    if (totalizerCycle) {
      if (em03.energyOk) {
        j.set("em03/total_energy_kwh", em03.energyKWh);
        emAny = true;
      }
    } else {
      if (em03.powerOk) {
        j.set("em03/power_kw", em03.powerKW);
        emAny = true;
      }
      if (em03.currentsOk) {
        j.set("em03/current_a", em03.currentA);
        j.set("em03/current_b", em03.currentB);
        j.set("em03/current_c", em03.currentC);
        emAny = true;
      }
    }
    if (emAny) {
      emOk = Firebase.RTDB.updateNodeSilent(&fbData, "/energy_meters", &j);
      if (!emOk)
        Serial.printf("[Firebase] /energy_meters ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  if (!butluurAny && !emAny) {
    led::setMode(led::SLOW_RED);
    return;
  }

  if (butluurOk && emOk) {
    Serial.println("[Firebase] Updated");
    fbOnSuccess();
    led::setMode(led::OFF);
    led::pulse();
  } else {
    fbOnFailure();
    led::setMode(led::SLOW_RED);
  }

  // OTA heartbeat + self-test gate (амжилттай upload бүрд +1)
  ota::loop(&fbData, butluurOk && emOk);
}
